In [28]:
import pandas as pd

In [29]:
df = pd.read_csv('OG.csv')
og = df

In [30]:
df = df.groupby("ID", as_index=False).agg(lambda x: ','.join(x.tolist()))

In [31]:
df_old = df
df.head()

,ID,MFName,Mno
0,1001,"VASANT,RITA","9322344686,9821095534"
1,1002,"KIRAN,INDUPAMA,BHAVYA,TRUSHTI","9223337404,9819713936,9326738045,9769279448"
2,1003,"NARENDRA,ANJANA","9324802920,9821053621"
3,1004,"JAYESH,JOLLY","8169152683,8169141643"
4,1005,"INDUKUMAR,MEERA","8104089344,9920325275"

In [32]:
new_df = df['Mno'].str.split(',', expand=True)

In [33]:
og.drop(columns=['Mno'], inplace=True)

In [34]:
res = pd.concat([og, new_df], axis=1)
temp = pd.read_csv('OG_back.csv')
temp.drop(columns=['MNoFinal', 'MPer', 'MFName', 'MMobile'], inplace=True)
res.drop(columns=['ID'], inplace=True)
pd.concat([temp, res], axis=1).to_csv('OG_final.csv', index=False)
res.head()

     MFName           0           1           2           3     4     5
0    VASANT  9322344686  9821095534        None        None  None  None
1      RITA  9223337404  9819713936  9326738045  9769279448  None  None
2     KIRAN  9324802920  9821053621        None        None  None  None
3  INDUPAMA  8169152683  8169141643        None        None  None  None
4    BHAVYA  8104089344  9920325275        None        None  None  None